/**
 * 1. Завдання: Написати програму яка буде перевіряти 
 *      чи рік народження користувача був високосним.
 * 2. Написати програму де компютер загадає число 
 *      від 1 до 10 і запропонує користувачу вгадати 
 *      його Користувач вводить свій варіант і отримує 
 *      результат (Виграв чи ні) Вивести результат в форматі 
 *      "Вітаю ви вгадали число (тут варіант компютера)" або 
 *      "Ви програли, компютер загадав (тут варіант компютера)".
 * 3. Написати програму, яка буде знаходити суму, різницю, 
 *      множення та ділення двух чисел. Користувач вводить 
 *      2 числа потім вводить знак операції і отримує результат 
 *      в форматі "Сумма чисел a i b = результат ".
 * 4. Написати програму, яка буде переводити температуру з Цельсія 
 *      по Фаренгейту, та навпаки з Фаренгейту в Цельсія.
 * 5. Написати програму, яка перевіряє чи попадає введене число в 
 *      діапазон від 55 до 99 включно.
 * 6. Написать программу, де користувач вводить 3 числа, після вводу 
 *      всіх чисел йому на екрані показуєнайбільше з них. 
 *      Додатково потрібно перевірити чи введені символи являються
 *      числами взагалі.
 * 7. Написати програму, яка переведе введену оцінку студента в Болонскому форматі, 
 *      де 89 - 100 це A, 75 - 88 це В, 60 - 74 це С, 45 - 59 це D, 20 - 44 це Е, до 20 це F.
 * 8. Написати програму, яка отримає від користувача число (кількість хвилин) 
 *      та виведе на екран рядок в форматі години та хвилини.
 *      Наприклад 70 покаже 1:10, 450 покажет 7:30, 1441 покажет 24: 1
 * 9. Написати гру Камінь-Ножиці-Папір, де комп'ютер загадує своє значення
 *      потім користувач вводить свій варіант і далі ми бачимо результат на екрані хто виграв.
 * 10. Створити поле довільних розмірів з м'ячем в межах поля. Нехай м’яч переміщається 
 *      при натисканні на поле, туди, де був клік. Вимоги:
 *       Центр м’яча повинен збігатися з курсором миші (якщо це можливо без перетину країв поля);
 *      CSS-анімація бажана, але не є обов’язковою;
 *       М’яч у жодному разі не повинен перетинати межі поля;
 *       При прокручуванні сторінки нічого не повинно ламатися;
 *       Нотатки:
 *       Код повинен уміти працювати з різними розмірами м’яча та поля, не прив’язуватися до будь-яких 
 *       фіксованих значень.
 *       Використовуйте властивості event.clientX/event.clientY, щоб вирахувати координати миші при кліці.

 */